#########################################################
#region 모듈 불러오기

Import-Module ".\modules\기본_핵심모듈.psm1" -Force
Import-Module ".\modules\추가_경매장 검색.psm1" -Force

#endregion
#########################################################
#region 설정 입력

$API_KEY = "API키를 입력하세요";

#endregion
#########################################################
#region 코드 작성
checkPerformance "코드 작성" 0 {
#-------------------------------------------------------#

조사 "이계 기운의 정화서";

$item =(횡검색 1 @{
    0 = "생숨";
    1 = "무마산"
    2 = "노영정"
    3 = "황큐"
    4 = "피로 회복의 영약"

    5 = "이계 기운의 정화서 제작법"
    6 = "농밀한 이계의 정수"
    7 = "황금 큐브 조각"
    8 = "0507e1440ba4d8b69652c7229b6b156a" # 이계 기운의 정화서

}).unitPrice;

## 내용 출력
$item;

""

## 피로약
"피로약 제작비용 : {0}" -f (($item[0] * 20) + ($item[1] * 1) + ($item[2] * 3) + ($item[3] * 3));
"피로약 구매비용 : {0:N0}" -f $item[4];

""

## 이계 정화서
"정화서 제작비용 : {0}" -f (한글단위(($item[5] * 1) + ($item[6] * 10) + ($item[7] * 100)));
"정화서 구매비용 : {0}" -f (한글단위($item[8]));

#-------------------------------------------------------#
};
#endregion