#########################################################
#region 모듈 불러오기

Import-Module ".\modules\기본_핵심모듈.psm1" -Force
Import-Module ".\modules\추가_경매장 검색.psm1" -Force

#endregion
#########################################################
#region 설정 입력

$API_KEY = "API키를 입력하세요";

#endregion
#########################################################
#region 코드 작성
checkPerformance "코드 작성" 0 {
#-------------------------------------------------------#

#조사 "블루 인페르노";

#종검색 "1017647dfda55fb3c56d7000883b59a4"; # 거너(남) 블루 인페르노 데빌 아머

조사 "성운의"

종검색 "성운의 침략자 에너지 코어";

#-------------------------------------------------------#
};
#endregion