#########################################################
#region 모듈 불러오기

Import-Module ".\modules\기본_핵심모듈.psm1" -Force

#endregion
#########################################################
#region 설정 입력

$API_KEY = "API키를 입력하세요";

#endregion
#########################################################
#region 코드 작성
checkPerformance "코드 작성" 1 {
#-------------------------------------------------------#

# 문자열 인코딩 테스트
인코딩("테스트");

""

# 소수점 버림 테스트 (원래 기본값은 반올림임)
소수버림(101.99998);

""

# 한국식 숫자 단위 테스트
한글단위(123456789012);
한글단위(9);
한글단위(99);
한글단위(999);
한글단위(9999);
한글단위(99999);
한글단위(999999);
한글단위(9999999);
한글단위(99999999);
한글단위(900009999);
한글단위(900099999);
한글단위(900909999);
한글단위(909009999);
한글단위(999999999);
한글단위(9999999999);
한글단위(99999999999);
한글단위(999999999999);
#한글단위(1000000000000);

""

# 시간비교 테스트
남은시간("2026-04-24 18:00:00");

# 요청함수 테스트
$Config = @{
    API_TYPE = "/df/auction"
    API_PARAMS = @{
        limit     = 10
        wordType  = "front"
        wordShort = "false"
        sort      = "unitPrice:asc"
    }
}
$Result = 서버요청 $Config @{ itemName = 인코딩("무색 큐브 조각") }
$Result.rows[0];

#-------------------------------------------------------#
};
#endregion